# St7SetVertexType

Sets the type for the specified vertex.

long St7SetVertexType(long uID, long VertexNum, long VertexType)

Input Parameters

uID

Strand7 model file ID.

VertexNum

Vertex number.

VertexType

Vertex type; either vtFree or vtFixed.